tap "felixkratz/formulae"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
brew "asdf"
brew "python@3.13"
brew "awscli"
brew "basedpyright"
brew "bat"
brew "bottom"
brew "direnv"
brew "elixir"
brew "elixir-ls"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "htop"
brew "jq"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mise"
brew "neovim"
brew "nowplaying-cli"
brew "nvm"
brew "ripgrep"
brew "rust-analyzer"
brew "source-highlight"
brew "spotify_player"
brew "switchaudio-osx"
brew "tesseract"
brew "tmux"
brew "tree"
brew "vfox"
brew "wget"
brew "wimlib"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "bitwarden"
cask "claude"
cask "claude-code"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "ghostty@tip"
cask "sf-symbols"
vscode "13xforever.language-x86-64-assembly"
vscode "1yib.rust-bundle"
vscode "alefragnani.rtf"
vscode "alexcvzz.vscode-sqlite"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "bbenoist.nix"
vscode "beardedbear.beardedtheme"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "chrisgfortes.theme-black-ops-vscode"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-images"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "endormi.2077-theme"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "fill-labs.dependi"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "geekidos.vdf"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "iagolaguna.vscodefy"
vscode "illixion.vscode-vibrancy-continued"
vscode "jakebecker.elixir-ls"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "josetr.cmake-language-support-vscode"
vscode "juanblanco.solidity"
vscode "leonardssh.vscord"
vscode "luniclynx.lex"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "nomicfoundation.hardhat-solidity"
vscode "nrwl.angular-console"
vscode "nur.just-black"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.fabric8-analytics"
vscode "redhat.vscode-community-server-connector"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rendinjast.amoled-black"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "s-nlf-fh.glassit"
vscode "seyyedkhandon.firacode"
vscode "smallbluedevelopment.discord-theme"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tarik02.absolutely-black"
vscode "thomaz.preparing"
vscode "tm.black"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "unthrottled.doki-theme"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "vincesalvino.dark-plus-black"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
